Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationOrigin Property
 The ExaggerationOrigin.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.ExaggerationOrigins ExaggerationOrigin { get; set; }
Public Property ExaggerationOrigin As DimensionSetBaseAttributes.ExaggerationOrigins
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.ExaggerationOrigins
See Also
Reference
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
Tekla.Structures.Drawing Namespace